---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FootPrintRoof
source: html/f1e1ff4f-80b8-c08b-6c88-fd01c57100e9.htm
---
# FootPrintRoof Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.